//
//  Data.swift
//  EZMilitaryService
//
//  Created by Allen Su on 5/28/25.
//

import Foundation

let teamMappings: [String: [String]] = [
    "文昌分隊": [
        // 北區 (18里)
        "明新里", "五常里", "錦平里", "育德里", "明德里", "邱厝里",
        "建興里", "崇德里", "梅川里", "頂厝里", "賴村里", "賴旺里",
        "賴明里", "賴厝里", "賴福里", "賴興里", "立人里", "長青里",
        
        // 北屯區 (7里)
        "平心里", "平安里", "平和里", "平陽里", "平順里", "平福里",
        "平德里",
    ],
    
    "北屯分隊": [
        
        // 北屯區 (10里)
        "三光里", "三和里", "北屯里", "北京里", "北興里",
        "平昌里", "平興里", "平田里", "東光里", "舊社里",
        // 北區 (7里)
        "金華里", "金龍里", "建成里", "建德里", "錦村里", "錦洲里", "錦祥里"
    ],
    
    "水湳分隊": [
        // 北屯區 (6里)
        "大德里", "仁愛里", "水湳里", "忠平里", "陳平里", "新平里",
        // 西屯區 (11里)
        "西平里", "逢甲里", "逢福里", "港尾里", "鵬程里", "大石里",
        "大河里", "大福里", "大鵬里", "何仁里", "何源里"
    ],
    
    "四平分隊": [
        // 北屯區 (11里)
        "松安里", "松竹里", "松和里", "仁和里", "仁美里", "四民里",
        "同榮里", "后庄里", "松勇里", "松茂里", "松強里"
    ],
    
    "東山分隊": [
        // 北屯區 (8里)
        "水景里", "軍功里", "和平里", "廓子里", "廍子里", "大坑里", "東山里",
        "民政里", "民德里"
    ]
]
